/* 생성자란 인스턴스가 생성될떄 호출되는 인스턴스 초기화 메서드입니다.
 *인스턴스 변수의 초기화 작업에 주로 사용되며 인스턴스 생성시에 실행되어야 할 작업을 위해 사용됩니다.
 *생성자 역시 메서드 처럼 클래스 내에 선언되며, 구조도 메서드와 비슷하지만 리턴값이 없습니다.
 *생성자 앞에는 void를 사용하지 않고 아무것도 적지 않습니다.
 *생성자 이름은 클래스 이름과 같아야하고 생성자는 리턴값이 없습니다.
 *생성자도 오버로딩이 가능하므로 하나의 클래스에 여러개의 생성자가 존재할 수 있습니다.
 * 모든 클래스에는 반드시 하나 이상의 생성자가 정의 되어 있어야 합니다.
 * 사용자가 정의 하지 않으면 컴파일러가 자동적으로 기본 생성자를 추가하여 컴파일 합니다.
 * 
 * */
public class ex07{


}    

class Card {
  Card() {                     //매개변수가 없는 생성자

  }

  Card(String k, int num) {    // 매개변수가 있는 생성자

  }

}    




